# SQl - Filtering & Logical Conditions 
    Filtering is one of the most important concepts in SQL for Data Analysis.
    It helps you narrow down large datasets to only the rows that matter for your question or business problem.
    Filtering is mainly done using the WHERE clause.

### Database Connection

In [3]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [5]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### Using Already Created employees table in Database

In [10]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### 1. WHERE Clause
    Used to filter rows based on conditions.
    Works row by row.
    Always comes after FROM and before ORDER BY.

### Get recored of employees from Mumbai city

In [21]:
%%sql
select * from employees
where city = 'Mumbai';

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[(102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12))]

### 2. Comparison Operators
    Used to compare values.
    =	Equal to
    >	Greater than
    <	Less than
    >=	Greater than or equal
    <=	Less than or equal
    != 	Not equal

### Employees with salary greater than 50,000

In [24]:
%%sql
select * from employees 
where salary > 50000;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Employees younger than or equal to 30

In [27]:
%%sql
select * from employees
where age <= 30;

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25))]

###  3. Logical Operators
    Used to combine multiple conditions.
    AND	-> All conditions must be true
    OR	-> At least one condition must be true
    NOT	-> Reverses a condition

### IT employees earning more than 50,000

In [31]:
%%sql
select * from employees
where department = 'IT' and salary > 50000;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25))]

### Employees from Pune OR Mumbai

In [36]:
%%sql
select * from employees
where city = 'Pune' or city = 'Mumbai';

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Employees NOT from IT department

In [43]:
%%sql
select * from employees
where not department ='IT';

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### 4. IN Operator
    Used when you want to match multiple values.
    Cleaner alternative to multiple OR conditions.

### Employees working in IT or HR

In [49]:
%%sql
select * from employees
where department in ('IT','HR');

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25))]

### 5. BETWEEN Operator
    Used to filter values within a range (inclusive).
    Works with numbers, dates, salaries, marks, etc.

### Employees with salary between 45,000 and 65,000

In [58]:
%%sql
select * from employees
where salary between 45000 and 65000;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Employees who joined between 2020 and 2022

In [67]:
%%sql
select * from employees
where joining_date between '2020-01-01' and '2022-12-31';

 * mysql+pymysql://root:***@localhost/test
5 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### 6. LIKE Operator (Pattern Matching)
    Used to filter text data.
    %	Any number of characters
    _	Exactly one character

### Names starting with 'A'

In [76]:
%%sql
select * from employees
where emp_name like 'A%' ;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Cities ending with 'i'

In [79]:
%%sql
select * from employees
where emp_name like '%i' ;

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

### 7. IS NULL / IS NOT NULL
    Used to check missing values.
    NULL ≠ 0 ≠ empty string

### Employees whose joining date is missing

In [83]:
%%sql
SELECT * FROM employees
WHERE joining_date IS NULL;

 * mysql+pymysql://root:***@localhost/test
0 rows affected.

[]

### Employees with known joining dates

In [86]:
%%sql
select * from employees
where joining_date is not null;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

## ANALYSIS-ORIENTED EXAMPLES

### High-paid IT employees below age 30

In [94]:
%%sql
select * from employees
where department = 'IT' and age < 30
order by salary desc;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[(106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10))]

### Employees from metro cities earning less than 50k

In [99]:
%%sql
select * from employees
where city in ('Bangalore','Mumbai','Pune') and salary < 50000;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[(102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12))]

### HR employees hired before 2021

In [102]:
%%sql
select * from employees
where department = 'HR' and joining_date < '2021-01-01';

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[(105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12))]